IDEA Open Model
LoadCaseSubType Enumeration
Compatible with IDEA StatiCa 20.1
 Load case sub type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum LoadCaseSubType
Public Enumeration LoadCaseSubType
Members
Member name | Value | Description
PermanentSelfweight | 0 |  Permanent - self weight
PermanentStandard | 1 |  Permanent - standard
PermanentPrestress | 2 |  Permanent - prestress (posttensioned)
PermanentRheologic | 3 |  Permanent - Rheologic
PermanentPrimaryEffect | 7 |  Permanent - primary effect
VariableStatic | 9 |  Variable - static
VariableDynamic | 10 |  Variable - dynamic
VariablePrimaryEffect | 11 |  Variable - primary effect
PermanentPrestressPretensioned | 15 |  Permanent - prestress (posttensioned)
PermanentPrestressPrimary | 16 |  Permanent - prestress primary effect
PermanentSelfweightLocal | 17 |  Permanent - self weight - local
See Also
Reference
IdeaRS.OpenModel.Loading Namespace